[{"Title": "From JPL's Mailroom to Mars and Beyond", "Preview": "Bill Allen has thrived as the mechanical systems design lead for three Mars rover missions, but he got his start as a teenager sorting letters for the NASA center."}, {"Title": "MAVEN Maps Electric Currents around Mars that are Fundamental to Atmospheric Loss", "Preview": "Five years after NASA’s MAVEN spacecraft entered into orbit around Mars, data from the mission has led to the creation of a map of electric current systems in the Martian atmosphere."}, {"Title": "NASA's Mars 2020 Comes Full Circle", "Preview": "Aiming to pinpoint the Martian vehicle's center of gravity, engineers took NASA's 2,300-pound Mars 2020 rover for a spin in the clean room at JPL. "}, {"Title": "NASA's Curiosity Keeps Rolling As Team Operates Rover From Home", "Preview": "The team has learned to meet new challenges as they work remotely on the Mars mission."}, {"Title": "A New Video Captures the Science of NASA's Perseverance Mars Rover", "Preview": "With a targeted launch date of July 30, the next robotic scientist NASA is sending to the to the Red Planet has big ambitions."}, {"Title": "NASA's Treasure Map for Water Ice on Mars", "Preview": "A new study identifies frozen water just below the Martian surface, where astronauts could easily dig it up."}, {"Title": "Alabama High School Student Names NASA's Mars Helicopter", "Preview": "Vaneeza Rupani's essay was chosen as the name for the small spacecraft, which will mark NASA's first attempt at powered flight on another planet."}, {"Title": "Sensors on Mars 2020 Spacecraft Answer Long-Distance Call From Earth", "Preview": "Instruments tailored to collect data during the descent of NASA's next rover through the Red Planet's atmosphere have been checked in flight."}, {"Title": "Space History Is Made in This NASA Robot Factory", "Preview": "From rockets to rovers, JPL's Spacecraft Assembly Facility has been at the center of robotic spaceflight. Here's a closer look at what makes it so special."}, {"Title": "The Detective Aboard NASA's Perseverance Rover", "Preview": "An instrument called SHERLOC will, with the help of its partner WATSON, hunt for signs of ancient life by detecting organic molecules and minerals."}, {"Title": "While Stargazing on Mars, NASA's Curiosity Rover Spots Earth and Venus", "Preview": "This new portrait of the Red Planet's neighbors was taken during a time when there's more dust in the air on Mars."}, {"Title": "The Man Who Wanted to Fly on Mars", "Preview": "The Mars Helicopter is riding to the Red Planet this summer with NASA's Perseverance rover. The helicopter's chief engineer, Bob Balaram, shares the saga of how it came into being."}, {"Title": "Newfound Martian Aurora Actually the Most Common; Sheds Light on Mars' Changing Climate", "Preview": "A type of Martian aurora first identified by NASA’s MAVEN spacecraft in 2016 is actually the most common form of aurora occurring on the Red Planet, according to new results from the mission."}, {"Title": "NASA's New Mars Rover Is Ready for Space Lasers", "Preview": "Perseverance is one of a few Mars spacecraft carrying laser retroreflectors. The devices could provide new science and safer Mars landings in the future."}, {"Title": "NASA's Mars 2020 Rover Goes Coast-to-Coast to Prep for Launch", "Preview": "The agency's first step in returning rocks from Mars just arrived at Kennedy Space Center. The Mars 2020 team now begins readying for a launch to the Red Planet this July."}]